#include <iostream>
#include <vector>

int main() {
    // кстати хорошие базовые ускорялки ввода/вывода
    std::ios::sync_with_stdio(false);
    std::cin.tie(nullptr);
    // ввод данных
    uint64_t k;  // число досок
    uint64_t n;  // число банок
    std::cin >> k >> n;
    std::vector<uint64_t> jars(n);
    uint64_t total = 0;
    for (int i = 0; i < n; ++i) {
        std::cin >> jars[i];
        total += jars[i];
    }
    // проверка, что они вообще могут это все покрыть
    if (total < k) {
        std::cout << -1 << "\n";
        return 0;
    }
    // сортируем по убыванию
    sort(jars.begin(), jars.end(), std::greater<uint64_t>());
    // выбираем как последнюю банку самую большую, чтобы минимум раз куда-то уходить
    uint64_t last = jars[0];
    uint64_t L = k - last;
    // если эта чудо-банка-гигант может покрыть все доски, то ответ у нас уже есть
    if (L <= 0) {
        std::cout << 2 * k << "\n";
        return 0;
    }
    // иначе набираем банки, пока их сумма меньше L (L - оставшееся число досок, которые еще не покрашены)
    uint64_t sum = 0;
    uint64_t m = 0;
    for (int i = 1; i < n; ++i) {  // перебираем от начала: уже отсортировали по невозрастанию
        sum += jars[i];
        ++m;
        if (sum >= L) break;
    }
    // распределяем L досок между выбранными банками
    uint64_t remaining = L;  // запоминаем, сколько досок надо было распределить
    uint64_t weighted_sum = 0;  // вес: сколько времени потребуется, чтобы добраться и покрасить
    // теперь жадно все перебираем: наиболее выгодные веса для самых больших банок, чтобы они не так сильно умножались
    // при хотьбе к ним и обратно
    for (int i = 1; i <= m; ++i) {
        uint64_t take = std::min(jars[i], remaining);  // сколько досок можем взять: хватит ли текущей банки?
        weighted_sum += take * i; // i — вес: 1 для самой большой, 2 для следующей и т.д.
        remaining -= take;  // запоминаем, что столько-то досок закрасили
        if (remaining == 0) break;
    }
    // получается, что ответ это сумма пути (который относится к последней банке) (2k, так как путь до самого конца это k, 
    // jars[i] требуется на покраску и k - jars[i] на перемещение оттуда) и сумма путей к остальным банкам + их веса
    // все пути туда/обратно, поэтому везде х2
    uint64_t ans = 2 * k + 2 * weighted_sum;
    std::cout << ans << "\n";  // выводим ответ

    return 0;
}